app/controllers/map_controller.rb

SELECT "ps_stores".* FROM "ps_stores"
---
  def index
    @ps_stores = PsStore.all